mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/ble_central_and_peripheral/experimental/ble_app_interactive/ble_m.c
NRF_BALLOC_DEF(m_srv_pool, sizeof(device_srv_t), NRF_BLE_LINK_COUNT);

/**@brief UUIDs which the central applications will scan for if the name above is set to an empty string,
 * and which will be advertised by the peripherals.
 */
ble_uuid_t m_adv_uuids[] = { { BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE },
                             { BLE_UUID_RUNNING_SPEED_AND_CADENCE, BLE_UUID_TYPE_BLE } };

static char * mp_roles_str[] =
{
    "INVALID_ROLE",
    "CENTRAL",
    "PERIPHERAL",
};


/**@brief Parameters used when scanning.
 */
static ble_gap_scan_params_t const m_scan_params =
{
    .active            = 1,
    .interval          = SCAN_INTERVAL,
    .window            = SCAN_WINDOW,
    .timeout           = SCAN_DURATION,
    .scan_phys         = BLE_GAP_PHY_1MBPS,
    .filter_policy     = BLE_GAP_SCAN_FP_ACCEPT_ALL,
};

static uint8_t m_scan_buffer_data[BLE_GAP_SCAN_BUFFER_MIN]; /**< Buffer where advertising reports will be stored by the SoftDevice. */

/**@brief Pointer to the buffer where advertising reports will be stored by the SoftDevice. */
static ble_data_t m_scan_buffer =
{
    m_scan_buffer_data,
    BLE_GAP_SCAN_BUFFER_MIN
};


/**@brief Connection parameters requested for connection.
 */
static ble_gap_conn_params_t const m_connection_param =
{
    MIN_CONNECTION_INTERVAL,
    MAX_CONNECTION_INTERVAL,
    SLAVE_LATENCY,
    SUPERVISION_TIMEOUT
};


/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of an assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    ASSERT(p_file_name);

    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


bool is_scanning(void)
{
    return m_scanning;
}


void addr_store_value_set(char const * const p_address_str)
{
    ASSERT(p_address_str);

    strcpy(m_addr_str_for_connection, p_address_str);
}


scanned_device_t * scan_device_info_get(void)
{
    return m_device;
}


void scan_device_info_clear(void)
{
    memset(m_device, 0, sizeof(m_device));
}


bool is_numeric_match_requested(void)
{
    return m_numeric_match_requested;
}


void numeric_match_request_clear(void)
{
    m_numeric_match_requested = false;
}


uint16_t numeric_match_request_conn_handle_get(void)
{
    return m_num_comp_conn_handle;
}


void preferred_phy_set(ble_gap_phys_t const * const p_phy, uint16_t conn_handle)
{
    ASSERT(p_phy);

    ret_code_t err_code;

    err_code = sd_ble_gap_phy_update(conn_handle, p_phy);
    APP_ERROR_CHECK(err_code);
}


uint16_t cccd_descriptors_handle_get(char const * const p_char_uuid_str)
{
    ASSERT(p_char_uuid_str);

    char uuid_str[UUID_STRING_LEN] = {0};

    // Searching for characteristic.
    for (uint8_t i = 0; i < m_srv_char.count; i++)
    {

        sprintf(uuid_str, "%X", m_srv_char.char_data[i].uuid.uuid);

        if ((!strcmp(uuid_str, p_char_uuid_str)) && m_srv_char.char_data[i].notify)
        {
           return m_srv_char.char_data[i].cccd_desc_handle;
        }
    }

    return BLE_GATT_HANDLE_INVALID;
}


/**@brief Function for searching for the CCCD of a characteristic.
 *
 * @param[in] char_uuid       Characteristic UUID.
 * @param[in] conn_handle     The connection handle identifying the connection to perform this procedure on.
 */

static void cccd_descriptors_search(uint16_t char_uuid, uint16_t conn_handle)
{
    uint8_t                  i;
    ret_code_t               err_code;
    ble_gattc_handle_range_t handle_range;
    uint16_t                 start_handle = 0;
    uint16_t                 end_handle   = 0;

    // Searching for the initial characteristic's handle.
    for (i = 0; i < m_srv_char.count; i++)
    {
        if (m_srv_char.char_data[i].uuid.uuid == char_uuid)
        {
            start_handle = m_srv_char.char_data[i].value_handle + 1;
            break;
        }
    }

    // Searching for the final characteristic's handle if the characteristic is not last in the service.
    if ((i < (m_srv_char.count - 1)) && (m_srv_char.char_data[i + 1].uuid.uuid != 0))
    {
        // If the characteristic is not last, start a handle equal to the declaration handle of the next characteristic's Declaration Handle.
        end_handle = m_srv_char.char_data[i + 1].decl_handle - 1;
    }
    // Searching for the final characteristic handle if the characteristic is last in the service, the end handle is equal to the service end handle.
    else
    {
        for (uint8_t j = 0; j < mp_device_srv[conn_handle]->count; j++)
        {
            if ((start_handle >
                 mp_device_srv[conn_handle]->services[j].handle_range.start_handle) &&
                (start_handle < mp_device_srv[conn_handle]->services[j].handle_range.end_handle))
            {
                end_handle = mp_device_srv[conn_handle]->services[j].handle_range.end_handle;
                break;
            }
        }
    }

    handle_range.start_handle = start_handle;
    handle_range.end_handle   = end_handle;

    // Discovery descriptors inside, the found handle range.
    err_code = sd_ble_gattc_descriptors_discover(conn_handle, &handle_range);
    APP_ERROR_CHECK(err_code);
}


