mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/ble_central_and_peripheral/experimental/ble_app_interactive/ble_m.c
    for (uint8_t i = 0; i < size; ++i)
    {
        NRF_LOG_RAW_INFO("%.2X ", p_addr[size - (i + 1)]);
    }

    NRF_LOG_RAW_INFO("\r\n");
}


/**@brief Function for parsing data from NFC central and connecting if data matches.
 *
 * @param[in]   p_gap_evt        Pointer to GAP data event.
 * @param[in]   p_peer_addr      Pointer to adv_report address.
 */
static void nfc_central_connect(ble_gap_evt_t const        * p_gap_evt,
                                ble_gap_addr_t const * const p_peer_addr)
{
    ret_code_t err_code;
    uint8_t  * p_adv_data;
    uint16_t   data_len;
    uint16_t   dev_name_offset = 0;
    uint16_t   field_len;
    char       dev_name[32];

    // Initialize advertisement report for parsing.
    p_adv_data = (uint8_t *)p_gap_evt->params.adv_report.data.p_data;
    data_len   = p_gap_evt->params.adv_report.data.len;

    // Search for advertising names.
    field_len = ble_advdata_search(p_adv_data,
                                   data_len,
                                   &dev_name_offset,
                                   BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME);

    if (field_len == 0)
    {
        // Look for the short local name if it was not found as complete.
        field_len = ble_advdata_search(p_adv_data,
                                       data_len,
                                       &dev_name_offset,
                                       BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME);

        if (field_len == 0)
        {
            // If data cannot be parsed, then exit.
            return;
        }
    }

    memcpy(dev_name, &p_adv_data[dev_name_offset], field_len);
    dev_name[field_len] = 0;

    NRF_LOG_DEBUG("Found advertising device: %s", nrf_log_push( (char *)dev_name));

    // Check if device address is the same as the address taken from the NFC tag.
    if (nfc_oob_pairing_tag_match(p_peer_addr))
    {
        // If the address is correct, stop scanning and initiate a connection with the peripheral device.
        err_code = sd_ble_gap_scan_stop();
        APP_ERROR_CHECK(err_code);

        err_code = sd_ble_gap_connect(p_peer_addr, &m_scan_params,
                                      &m_connection_param,
                                      APP_BLE_CONN_CFG_TAG);
        APP_ERROR_CHECK(err_code);
    }
}


void private_connect(pm_peer_id_t const * p_peers_id)
{
    ASSERT(p_peers_id);

    ret_code_t     err_code;
    ble_gap_addr_t public_addr;

    memset(&public_addr, 0, sizeof(public_addr));
    pm_peer_data_bonding_t data;
    memset(&data, 0, sizeof(data));

    // Load device bonding data.
    err_code = pm_peer_data_bonding_load(*p_peers_id, &data);

    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Try again with correct peer ID.");
        return;
    }

    memcpy(&public_addr,
           &data.peer_ble_id.id_addr_info,
           sizeof(public_addr));

     // Stop scanning.
    (void)sd_ble_gap_scan_stop();

    // Set device identities list.
    err_code = pm_device_identities_list_set(p_peers_id, 1);
    APP_ERROR_CHECK(err_code);

    scan_start();

    // Connect with device using privacy by public address.
    err_code = sd_ble_gap_connect(&public_addr, &m_scan_params,
                                  &m_connection_param,
                                  APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling primary service discovery response.
 *
 * @details This function will handle the primary service discovery response.
 *
 * @param[in] p_ble_gattc_evt   Pointer to the GATT Client event.
 */
static void on_primary_srv_discovery_rsp(ble_gattc_evt_t const * p_ble_gattc_evt)
{
    uint16_t        count;
    uint16_t        bytes_to_copy;
    uint16_t        conn_handle;
    static uint16_t offset = 0;
    ret_code_t      err_code;

    // For readability.
    ble_gattc_evt_prim_srvc_disc_rsp_t const * p_prim_serv =
        &(p_ble_gattc_evt->params.prim_srvc_disc_rsp);
    conn_handle = p_ble_gattc_evt->conn_handle;
    ble_gattc_service_t * const p_service =
        mp_device_srv[conn_handle]->services;

    // Number of discovered services.
    count = p_prim_serv->count;

    // If no more services are found.
    if ((count != 0) && 
        (p_ble_gattc_evt->gatt_status == BLE_GATT_STATUS_SUCCESS))
    {
        if ((count + offset) > MAX_SERVICE_COUNT)
        {
            bytes_to_copy = MAX_SERVICE_COUNT - offset;
        }
        else
        {
            bytes_to_copy = count;
        }

        // Save services data.
        memcpy((p_service + offset),
               p_prim_serv->services,
               bytes_to_copy * sizeof(ble_gattc_service_t));

        offset += count;

        // If the last service has not been reached, this function must be called again with a new start handle.
        err_code = sd_ble_gattc_primary_services_discover(
            conn_handle,
            p_prim_serv->services[count - 1].handle_range.end_handle,
            NULL);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        mp_device_srv[conn_handle]->count = offset;

        // If service UUID type is unknown, then look for a 128-bit UUID.
        // Only the first one is searched for here, the rest is searched for in the @ref on_read_rsp.
        for (uint8_t i = 0; i < offset; i++)
        {
            if (p_service[i].uuid.type == BLE_UUID_TYPE_UNKNOWN)
            {
                m_vendor_uuid_read = true;
                // Read service 128-bit UUID.
                err_code = sd_ble_gattc_read(conn_handle, p_service[i].handle_range.start_handle, 0);
                APP_ERROR_CHECK(err_code);
                offset = 0;

                return;
            }
        }

        NRF_LOG_INFO("Services count: %d", offset);
        uuid_print(p_ble_gattc_evt->conn_handle, p_service);

        offset = 0;
    }
}


/**@brief Function for starting a discovery of CCCD descriptors.
 *
 * @details If characteristics can be notified, then look for CCCD descriptors in all 
 *          characteristics inside the service.
 *
 * @param[in] p_ble_gattc_evt 
 */
static void cccd_descriptors_discovery(ble_gattc_evt_t const * p_ble_gattc_evt)
{
    for (uint8_t i = 0; i < m_srv_char.count; i++)
    {
        // If it is possible to enable notification.
        if (m_srv_char.char_data[i].notify)
        {
            // Search for CCCD descriptor handle
            cccd_descriptors_search(m_srv_char.char_data[i].uuid.uuid, p_ble_gattc_evt->conn_handle);
        }
    }
}


/**@brief Function for handling a characteristic discovery response.
 *
 * @param[in] p_ble_gattc_evt   Pointer to the GATT Client event.
 */
static void on_characteristics_discovery_rsp(ble_gattc_evt_t const * p_ble_gattc_evt)
{
    uint16_t        count;
    static uint16_t offset = 0;;
    uint16_t        bytes_to_copy;
    ret_code_t      err_code;
    uint16_t        conn_handle = p_ble_gattc_evt->conn_handle;

    // For readability.
    count = p_ble_gattc_evt->params.char_disc_rsp.count;
    ble_gattc_evt_char_disc_rsp_t const * p_char_disc_rsp_evt;

    p_char_disc_rsp_evt = &(p_ble_gattc_evt->params.char_disc_rsp);

    if (p_ble_gattc_evt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
        if ((count + offset) > MAX_CHARACTERISTIC_COUNT)
        {
            bytes_to_copy = MAX_CHARACTERISTIC_COUNT - offset;
            NRF_LOG_RAW_INFO("Too many characteristics discovered\r\n");
        }
        else
        {
            bytes_to_copy = count;
        }

        // Save characteristics data.
       for (uint8_t i = offset; i < bytes_to_copy; i++)
       {
           m_srv_char.char_data[i].decl_handle      = p_char_disc_rsp_evt->chars[i].handle_decl;
           m_srv_char.char_data[i].value_handle     = p_char_disc_rsp_evt->chars[i].handle_value;
           m_srv_char.char_data[i].uuid             = p_char_disc_rsp_evt->chars[i].uuid;
           m_srv_char.char_data[i].notify           = p_char_disc_rsp_evt->chars[i].char_props.notify;
           m_srv_char.char_data[i].cccd_desc_handle = 0;

           offset++;
       }

       // Display characteristics data.
       for (uint8_t i = 0; i < offset; i++)
       {
           ble_gatt_char_props_t char_param =
                p_ble_gattc_evt->params.char_disc_rsp.chars[i].char_props;

           NRF_LOG_RAW_INFO("Characteristic UUID: %X\r\n",
                            p_ble_gattc_evt->params.char_disc_rsp.chars[i].uuid.uuid);
           NRF_LOG_RAW_INFO("Parameters:\r\n");
           NRF_LOG_RAW_INFO("broadcast: %d ", char_param.broadcast);
           NRF_LOG_RAW_INFO("read: %d ", char_param.read);
           NRF_LOG_RAW_INFO("write_wo_resp: %d ", char_param.write_wo_resp);
           NRF_LOG_RAW_INFO("write: %d ", char_param.write);
           NRF_LOG_RAW_INFO("notify: %d\r\n", char_param.notify);
           NRF_LOG_RAW_INFO("indicate: %d ", char_param.indicate);
           NRF_LOG_RAW_INFO("auth_signed_wr: %d\r\n", char_param.auth_signed_wr);
       }
    }
    // If the last characteristic has not been reached, look for a new handle range.
    ble_gattc_handle_range_t handle_range;

