mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/ble_central_and_peripheral/experimental/ble_app_interactive/ble_m.c
    handle_range.start_handle = m_srv_char.char_data[offset - 1].value_handle + 1;

    // Search for end handle.
    for (uint8_t j = 0; j < mp_device_srv[conn_handle]->count; j++)
    {
        if (handle_range.start_handle >
             mp_device_srv[conn_handle]->services[j].handle_range.start_handle)
        {
            handle_range.end_handle =
                mp_device_srv[conn_handle]->services[j].handle_range.end_handle;
            break;
        }
    }

    // Handle value of the characteristic being discovered is less than the end handle of
    // the service being discovered. There is no possibility of more characteristics being
    // present.
    if ((m_srv_char.char_data[offset - 1].value_handle >= handle_range.end_handle) ||
        (offset == MAX_CHARACTERISTIC_COUNT) ||
        (p_ble_gattc_evt->gatt_status != BLE_GATT_STATUS_SUCCESS))
    {
        NRF_LOG_RAW_INFO("Number of characteristics: %d\r\n", offset);
        m_srv_char.count = offset;
        offset           = 0;

        // Search for the CCCD descriptors.
        cccd_descriptors_discovery(p_ble_gattc_evt);

        return;
    }

    // If the last Characteristic has not been reached, this function must be called again with new handle range.
    err_code = sd_ble_gattc_characteristics_discover(p_ble_gattc_evt->conn_handle, &handle_range);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling descriptor discovery response.
 *
 * @param[in] p_ble_gattc_evt   Pointer to the GATT Client event.
 */
static void on_descriptor_discovery_rsp(const ble_gattc_evt_t * const p_ble_gattc_evt)
{
    uint16_t   count;
    uint16_t   conn_handle = p_ble_gattc_evt->conn_handle;
    ret_code_t err_code;

    count = p_ble_gattc_evt->params.desc_disc_rsp.count;

    // If no more descriptors are found.
    if (count == 0)
    {
        NRF_LOG_RAW_INFO("No descriptors for characteristic, ",
                         "notifications and indications not possible\r\n");
        return;
    }

    if (p_ble_gattc_evt->gatt_status != BLE_GATT_STATUS_SUCCESS)
    {
        return;
    }

    // If the descriptor was found, connect it to the characteristic.
    for (uint8_t i = 0; i < count; i++)
    {
        if (p_ble_gattc_evt->params.desc_disc_rsp.descs[i].uuid.uuid == CCCD_DESCRIPTOR_UUID)
        {
            for (uint8_t j = 0; j < m_srv_char.count; j++)
            {
                if (m_srv_char.char_data[j].cccd_desc_handle == 0 && m_srv_char.char_data[j].notify)
                {
                    m_srv_char.char_data[j].cccd_desc_handle =
                        p_ble_gattc_evt->params.desc_disc_rsp.descs[i].handle;
                }
            }
            return;
        }
    }

    // If the last descriptors have not been found, look for a new handle range to search for.
    ble_gattc_handle_range_t handle_range;
    memset(&handle_range, 0, sizeof(handle_range));

    handle_range.start_handle = p_ble_gattc_evt->params.desc_disc_rsp.descs[count - 1].handle + 1;

    for (uint8_t i = 0; i < m_srv_char.count; i++)
    {
        // Search for end handle, to descriptors searching.
        if ((handle_range.start_handle >= m_srv_char.char_data[i].value_handle) &&
            (i < (m_srv_char.count - 1)))
        {
            // If current characteristic is not last in service
            handle_range.end_handle = m_srv_char.char_data[i + 1].decl_handle - 1;
            break;
        }
        // If the characteristic is last into service, search for service end handle.
        if (i == (m_srv_char.count - 1))
        {
            for (uint8_t j = 0; j < mp_device_srv[conn_handle]->count; j++)
            {
                if ((handle_range.start_handle >
                     mp_device_srv[conn_handle]->services[j].handle_range.start_handle) &&
                    (handle_range.start_handle <
                     mp_device_srv[conn_handle]->services[j].handle_range.end_handle))
                {
                    handle_range.end_handle =
                        mp_device_srv[conn_handle]->services[j].handle_range.end_handle;
                    break;
                }
            }
        }
    }

    // If the last descriptors have not been reached, this function must be called again with a new handle range.
    err_code = sd_ble_gattc_descriptors_discover(conn_handle, &handle_range);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling a read response.
 *
 * @param[in] p_ble_gattc_evt   Pointer to the GATT Client event.
 */
static void on_read_rsp(const ble_gattc_evt_t * const p_ble_gattc_evt)
{
    ret_code_t                       err_code;
    uint16_t                         conn_handle = p_ble_gattc_evt->conn_handle;
    ble_uuid128_t                    uuid;
    const ble_gattc_evt_read_rsp_t * p_read_rsp = &(p_ble_gattc_evt->params.read_rsp);

    if (m_vendor_uuid_read)
    {
        for (uint8_t i = 0; i < mp_device_srv[conn_handle]->count; i++)
        {
            if (p_read_rsp->handle ==
                mp_device_srv[conn_handle]->services[i].handle_range.start_handle)
            {
                //lint -save -e420
                memcpy(uuid.uuid128, p_read_rsp->data, sizeof(uuid.uuid128));
                //lint -restore
                err_code = sd_ble_uuid_vs_add(&uuid, &mp_device_srv[conn_handle]->services[i].uuid.type);
                APP_ERROR_CHECK(err_code);
                break;
            }
        }

        // If service UUID type is unknown, then try to search for the 128-bit UUID.
        for (uint8_t i = 0; i < mp_device_srv[conn_handle]->count; i++)
        {
            if (mp_device_srv[conn_handle]->services[i].uuid.type == BLE_UUID_TYPE_UNKNOWN)
            {
                m_vendor_uuid_read = true;
                // Look for service 128-bit UUID.
                err_code = sd_ble_gattc_read(conn_handle, mp_device_srv[conn_handle]->services[i].handle_range.start_handle, 0);
                APP_ERROR_CHECK(err_code);
                return;
            }

            // If service is last.
            if (i == (mp_device_srv[conn_handle]->count - 1))
            {
                NRF_LOG_INFO("Services count: %d", mp_device_srv[conn_handle]->count);
                m_vendor_uuid_read = false;
                // Print services UUID. When you first discover services, the 128-bit UUIDs may not be displayed.
                // In such case, you should rediscover the services.
                uuid_print(p_ble_gattc_evt->conn_handle, mp_device_srv[conn_handle]->services);
            }
        }

        return;
    }

    NRF_LOG_RAW_INFO("Read data:\r\n");

    for (uint8_t i = 0; i < p_read_rsp->len; i++)
    {
        NRF_LOG_RAW_INFO("0x%X ", p_read_rsp->data[i]);
    }

