mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/ble_central_and_peripheral/experimental/ble_app_interactive/ble_m.c
    NRF_LOG_RAW_INFO("\r\n");

    // The application only supports reading data of length less than MTU which was set for this connection.
}


/**@brief Function for handling a write response.
 *
 * @param[in] p_ble_gattc_evt   Pointer to the GATT Client event.
 */
static void on_write_rsp(const ble_gattc_evt_t * const p_ble_gattc_evt)
{
    // For readability.
    const ble_gattc_evt_write_rsp_t * p_write_rsp = &(p_ble_gattc_evt->params.write_rsp);

    // Display gattc write status.
    NRF_LOG_RAW_INFO("Type of write operation: 0x%x\r\n", p_write_rsp->write_op);
    NRF_LOG_RAW_INFO("Data was written to the server \r\n");

    for (uint8_t i = 0; i < p_write_rsp->len; i++)
    {
        NRF_LOG_RAW_INFO("%d ", p_write_rsp->data[i]);
    }

    if (p_write_rsp->len > 0)
    {
        NRF_LOG_RAW_INFO("\r\n");
    }

}


static void on_ble_evt(uint16_t conn_handle, ble_evt_t const * p_ble_evt)
{
    ret_code_t err_code;
    char       passkey[BLE_GAP_PASSKEY_LEN + 1];
    uint16_t   role = ble_conn_state_role(conn_handle);

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        {
            // Store device data to dynamic command buffer and for futher operations.
            m_connected_peers[conn_handle].address =
                p_ble_evt->evt.gap_evt.params.connected.peer_addr;
            connected_to_cmd_add(m_connected_peers, conn_handle);
            // Display device address.
            hex_addr_display(p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr,
                             BLE_GAP_ADDR_LEN);
            // Allocation memory for services data.
            mp_device_srv[conn_handle] = (device_srv_t *)nrf_balloc_alloc(&m_srv_pool);
        }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            // Clearing device data.
            connected_to_cmd_remove(m_connected_peers, conn_handle);
            memset(&m_connected_peers[conn_handle], 0x00, sizeof(m_connected_peers[0]));
            // Release of allocated memory.
            nrf_balloc_free(&m_srv_pool, mp_device_srv[conn_handle]);
            break;

        case BLE_GAP_EVT_PASSKEY_DISPLAY:
            memcpy(passkey,
                   p_ble_evt->evt.gap_evt.params.passkey_display.passkey,
                   BLE_GAP_PASSKEY_LEN);
            passkey[BLE_GAP_PASSKEY_LEN] = 0x00;
            NRF_LOG_INFO("%s: BLE_GAP_EVT_PASSKEY_DISPLAY: passkey=%s match_req=%d",
                         nrf_log_push(mp_roles_str[role]),
                         nrf_log_push(passkey),
                         p_ble_evt->evt.gap_evt.params.passkey_display.match_request);

            if (p_ble_evt->evt.gap_evt.params.passkey_display.match_request)
            {
                NRF_LOG_INFO("Type /numeric accept/ to confirm, /numeric reject/ to reject");
                m_num_comp_conn_handle    = conn_handle;
                m_numeric_match_requested = true;
            }

            break;

        case BLE_GAP_EVT_AUTH_KEY_REQUEST:
            key_request_set();
            NRF_LOG_DEBUG("%s: BLE_GAP_EVT_AUTH_KEY_REQUEST", nrf_log_push(mp_roles_str[role]));
            break;

        case BLE_GAP_EVT_LESC_DHKEY_REQUEST:
            NRF_LOG_DEBUG("%s: BLE_GAP_EVT_LESC_DHKEY_REQUEST", nrf_log_push(mp_roles_str[role]));
            break;

        case BLE_GAP_EVT_AUTH_STATUS:
            NRF_LOG_INFO(
                "%s: BLE_GAP_EVT_AUTH_STATUS: status=0x%x bond=0x%x lv4: %d",
                nrf_log_push(mp_roles_str[role]),
                p_ble_evt->evt.gap_evt.params.auth_status.auth_status,
                p_ble_evt->evt.gap_evt.params.auth_status.bonded,
                p_ble_evt->evt.gap_evt.params.auth_status.sm1_levels.lv4);
            NRF_LOG_DEBUG("kdist_own:0x%x kdist_peer:0x%x",
                          *( (uint8_t *)&p_ble_evt->evt.gap_evt.params.auth_status.kdist_own),
                          *( (uint8_t *)&p_ble_evt->evt.gap_evt.params.auth_status.kdist_peer));
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
            NRF_LOG_RAW_INFO("PHY update request\r\n");
            ble_gap_phys_t phy_param =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_gap_evt->conn_handle, &phy_param);
            APP_ERROR_CHECK(err_code);
        }
        break;

        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
        {
            on_primary_srv_discovery_rsp(&(p_ble_evt->evt.gattc_evt));
        }
        break;

        case BLE_GATTC_EVT_CHAR_DISC_RSP:
        {
            on_characteristics_discovery_rsp(&(p_ble_evt->evt.gattc_evt));
        }
        break;

        case BLE_GATTC_EVT_DESC_DISC_RSP:
        {
            on_descriptor_discovery_rsp(&(p_ble_evt->evt.gattc_evt));
        }
        break;

        case BLE_GATTC_EVT_READ_RSP:
        {
            on_read_rsp(&(p_ble_evt->evt.gattc_evt));
        }
        break;

        case BLE_GATTC_EVT_WRITE_RSP:
        {
            on_write_rsp(&(p_ble_evt->evt.gattc_evt));
        }
        break;

        case BLE_GATTC_EVT_HVX:
        {
            // If server sends an indication, then send a Handle Value Confirmation to the GATT Server.
            if (p_ble_evt->evt.gattc_evt.params.hvx.type == BLE_GATT_HVX_INDICATION)
            {
                err_code = sd_ble_gattc_hv_confirm(p_ble_evt->evt.gattc_evt.conn_handle,
                                                   p_ble_evt->evt.gattc_evt.params.hvx.handle);
                APP_ERROR_CHECK(err_code);
            }

            uint8_t data_len = p_ble_evt->evt.gattc_evt.params.hvx.len;
            NRF_LOG_RAW_INFO(
                "%s data: ",
                (p_ble_evt->evt.gattc_evt.params.hvx.type !=
                 BLE_GATT_HVX_NOTIFICATION) ? "Indication" : "Notification");

            // Display notifications or indication data.
            for (uint8_t i = 0; i < data_len; i++)
            {
                NRF_LOG_RAW_INFO("%d ", p_ble_evt->evt.gattc_evt.params.hvx.data[i]);
            }

