mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/ble_central_and_peripheral/experimental/ble_app_interactive/ble_m.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**
 * @brief Function for initializing a block allocator.
 */
static inline void balloc_init(void)
{
    ret_code_t err_code;

    err_code = nrf_balloc_init(&m_srv_pool);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Battery service. */
static void bas_init(void)
{
    ret_code_t     err_code;
    ble_bas_init_t bas_init_struct;
    uint8_t        initial_batt_lvl;

    // Initialize the Battery Service.
    initial_batt_lvl = BATTERY_INITIAL_LVL;

    memset(&bas_init_struct, 0, sizeof(bas_init_struct));

    bas_init_struct.evt_handler          = NULL;
    bas_init_struct.support_notification = true;
    bas_init_struct.p_report_ref         = NULL;
    bas_init_struct.initial_batt_level   = initial_batt_lvl;

    // Require LESC with MITM (Numeric Comparison)
    BLE_GAP_CONN_SEC_MODE_SET_LESC_ENC_WITH_MITM(&bas_init_struct.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init_struct.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init_struct.battery_level_char_attr_md.write_perm);

    // Require LESC with MITM (Numeric Comparison)
    BLE_GAP_CONN_SEC_MODE_SET_LESC_ENC_WITH_MITM(&bas_init_struct.battery_level_report_read_perm);

    err_code = ble_bas_init(&m_bas, &bas_init_struct);
    APP_ERROR_CHECK(err_code);
}


void ble_m_init(void)
{
    // Initialization of required BLE components.
    balloc_init();
    buttons_leds_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    bas_init();
    conn_params_init();
    advertising_init();
}


